#Пользователь вводит свое имя, необходимо поздороваться
name = input('Введите ваше имя:')
print('Здравствуйте,',name)
