#Пользователь вводит 2 числа(возможно дробные)
#вывести результат их сложения, вычитания, умножения,
#деления, возведения в степень, деления по модулю,
#целочисленного деления

a = int(input ('Введите первое число: '))
b = int(input('Введите второе число: '))
c = a + b
d = a - b
e = a * b
f = a / b
g = a ** b
k = a % b
l = a // b
print('сложение чисел: ',c)
print('Вычитание чисел: ',d)
print('Умножение чисел: ',e)
print('Деление чисел: ',f)
print('Возведение в степень: ',g)
print('Деление по модулю: ',k)
print('Целочисленное деление: ',l)

